var Messages = {
    app:{
        name:'راهنما تل',
    },
    user: {
        first_name_require: "لطفا نام خود را وارد نمایید.",
        last_name_require: "لطفا نام خانوادگی خود را وارد نمایید.",
        username_require: "لطفا شماره موبایل خود را وارد نمایید.",
        verifyCode_require: "لطفا کد فعالسازی را وارد نمایید.",
        username_length: "شماره موبایل نباید از 11 رقم کمتر باشد",
        username_pattern: "شماره موبایل باید فقط از اعداد تشکیل شده باشد.",
        mobile_require: "لطفا شماره همراه خود را وارد نمایید.",
        email_require: "لطفا ایمیل خود را وارد نمایید.",
        email_pattern: "لطفا ایمیل خود را به شکل صحیح وارد نمایید.",
        password_length: "کلمه عبور باید حداقل دارای 6 حرف باشد.",
        confirm_password_match: "کلمه عبور و تکرار آن با هم یکسان نیستند.",
        gender_require: "لطفا جنسیت خود را انتخاب نمایید.",
        birth_date_require: "لطفا تاریخ تولد خود را به طور کامل وارد کنید.",
        address_require: "لطفا آدرس خود را کامل و دقیق وارد نمایید.",
        guest: "شما به عنوان کاربر مهمان وارد شده اید. لطفا جهت ورود به این بخش ابتدا در برنامه ثبت نام نمایید. با تشکر",
        register_success: "ثبت نام شما با موفقیت انجام شد.",
        register_require_info: "لطفا فیلدها را کامل نمایید.",
        send_password: "کلمه عبور جدید ارسال شد.",
        profile_success: "اطلاعات کاربری شما با موفقیت ثبت شد.",
        email_or_username: "جهت بازیابی رمز عبور نام کاربری و یا ایمیل خود را وارد نمایید.",
        no_budget: "شارژ شما برای برقراری تماس کافی نمی باشد.",
        no_language: "ابتدا زبان ترجمه مورد نظر را انتخاب نمایید.",
        verify_code_sent: "كد فعالسازي با موفقيت ارسال شد."
    },
    general: {
        please_wait: "لطفا منتظر بمانید ...",
        c200_success: "",
        c200_success_action: "اطلاعات با موفقيت ثبت شد.",
        c200_success_Update: "اطلاعات شما با موفقیت تغییر یافت.",
        c200_success_sendCode: "کد تایید با موفقیت ارسال شد ... ",
        c401_unauthorized: "دسترسی غیر مجاز می باشد.",
        c403_unRegister: "کاربری با این شماره تماس یافت نشد. لطفا ثبت نام کنید.",
        c404_internet_connection_error: "مشکل در اتصال به اینترنت",
        c406_not_acceptable: "اطلاعات وارد شده صحیح نیست یا کاربر غیر فعال شده است.",
        c409_conflict: "اطلاعات ارسالی صحیح نمی باشد.",
        c500_server_error: "خطایی از جانب سرور رخ داده است. لطفا مجددا تلاش نمایید.",
        c504_login_again: " لطفا مجددا به سیستم وارد شوید.",
        c1001_username_before_selected: "نام کاربری انتخاب شده قبلا در سیستم ثبت گردیده است.",
        c1002_username_condition: "نام کاربری انتخاب شده اشتباه است.<br> نام کاربری باید دارای شرایط زیر باشد:<br> 1- با حروف انگلیسی نوشته شود.<br> 2- باید حداقل دارای 6 حرف باشد.",
        c1003_email_before_selected: "ایمیل انتخاب شده قبلا در سیستم ثبت گردیده است.",
        c1004_email_mistake: "ایمیل انتخاب شده اشتباه است.",
        c1005_password_mistake: "کلمه عبور انتخاب شده اشتباه است.",
        c1006_email_not_found: "ایمیل وارد شده پیدا نشد.",
        welcome: "به راهنما تل خوش آمدید.",
        unknown_error: "خطایی رخ داده است. لطفا مجددا تلاش نمایید.",
        location_error:"لطفا gps گوشی خود را فعال نمایید.",
        otherCode: function(code) {
            return "خطایی ناشناخته با کد " + code + "رخ داده است.<br/>لطفا مجددا تلاش نمایید.";
        }
    },
    problem: {
        internet: "مشکل در اتصال به اینتر نت.",
        check_connection: "اتصال به اینترنت ممکن نیست..."
    },
    prevPageBtn: {
        text: 'آیا از برنامه خارج می شوید؟',
        exit: 'خروج',
        cancel: 'انصراف'
    },
    btn:{
        exit: 'خروج',
        cancel: 'انصراف',
        login: 'ورود',
        close: 'بستن',
        register: 'ثبت نام',
        try_again: 'تلاش مجدد ...',
    },
    payment:{
      bank_connection_error: "خطایی در ارتباط با بانک مقصد رخ داده است.",
      future_feature: "این بخش در آینده راه اندازی می شود.",
      enter_amunt:"لطفا مبلغ شارژ خود را وارد نمایید.",
      amountBelow: "با عرض پوزش، امکان شارژ کمتر از 10000 ریال وجود ندارد."
    },
    polling:{
        send_polling:"نظر شما با موفقیت ثبت شد."
    },
    setting:{
        select_language: "Please select your language"
    },
    call:{
        connected:"تماس برقراری شده",
        connecting:"در حال برقرای تماس ...",
    }
};
